# Host: localhost  (Version 5.7.20-log)
# Date: 2020-03-20 12:13:24
# Generator: MySQL-Front 6.0  (Build 2.20)


#
# Structure for table "admin"
#

DROP TABLE IF EXISTS `admin`;
CREATE TABLE `admin` (
  `Id` int(11) NOT NULL AUTO_INCREMENT,
  `user` varchar(255) NOT NULL DEFAULT '',
  `password` int(11) NOT NULL DEFAULT '0',
  PRIMARY KEY (`Id`)
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8;

#
# Data for table "admin"
#

INSERT INTO `admin` VALUES (1,'小吴',121212),(2,'小唐',131313),(3,'小杨',111111);

#
# Structure for table "crop_production"
#

DROP TABLE IF EXISTS `crop_production`;
CREATE TABLE `crop_production` (
  `Id` int(11) NOT NULL AUTO_INCREMENT,
  `landmass_idname` varchar(255) DEFAULT '',
  `landmass_id` varchar(255) DEFAULT '',
  `landmass` varchar(255) DEFAULT '',
  `landmass_name` varchar(255) DEFAULT '',
  `agrotype` varchar(255) DEFAULT '',
  `crop_name` varchar(255) DEFAULT '',
  `crop_id` varchar(255) DEFAULT '',
  `crop_plant_area` varchar(255) DEFAULT '',
  `landmass_controller` varchar(255) DEFAULT '',
  `plant_time` varchar(255) DEFAULT '',
  `plant_pattern` varchar(255) DEFAULT '',
  PRIMARY KEY (`Id`)
) ENGINE=InnoDB AUTO_INCREMENT=72 DEFAULT CHARSET=utf8;

#
# Data for table "crop_production"
#

INSERT INTO `crop_production` VALUES (1,'A','A01','阳江市','阳江市A01','叶菜类','大白菜','B001','2.23亩','小吴','2019-3-12至2019-3-30','人工播种'),(2,'A','A01','阳江市','阳江市A01','叶菜类','菜心','B002','5.36亩','小吴','2019-2-10至2019-3-22','人工播种'),(3,'A','A01','阳江市','阳江市A01','叶菜类','生菜','B003','7.11亩','小吴','2019-12-07至2020-2-13','人工播种'),(4,'A','A01','阳江市','阳江市A01','叶菜类','大白菜','B001','1.20亩','小吴','2019-1-10至2019-1-28','人工播种'),(5,'A','A01','阳江市','阳江市A01','叶菜类','大白菜','B001','3.21亩','小吴','2019-2-20至2019-3-01','人工播种'),(6,'A','A02','阳江市','阳江市A02','叶菜类','菜心','B002','3.45亩','小吴','2019-9-11至2019-11-23','机械播种'),(7,'A','A02','阳江市','阳江市A02','叶菜类','生菜','B003','6.34亩','小吴','2019-3-12至2019-5-23','机械播种'),(8,'A','A03','阳江市','阳江市A03','叶菜类','菠菜','B004','1.22亩','小吴','2019-4-15至2019-5-26','人工播种'),(9,'A','A04','阳江市','阳江市A04','根茎类','萝卜','B005','7.21亩','小吴','2019-5-12至2019-6-30','人工播种'),(10,'A','A04','阳江市','阳江市A04','根茎类','土豆','B006','1.36亩','小吴','2019-5-03至2019-7-18','人工播种'),(11,'A','A05','潮州市','潮州市A05','瓜类','黄瓜','B009','5.76亩','小吴','2019-4-16至2019-12-30','人工播种'),(12,'B','B01','阳江市','阳江市B01','无作物','无','无','无','小刘','2019-2-06至2019-3-30','无'),(13,'B','B02','阳江市','阳江市B02','无作物','无','无','无','小刘','2019-4-01至2019-4-29','无'),(14,'B','B03','阳江市','阳江市B03','叶菜类','麦菜','B008','4.86亩','小刘','2019-1-12至2019-4-22','机械播种'),(15,'B','B03','阳江市','阳江市B03','叶菜类','大白菜','B001','2.78亩','小刘','2019-1-23至2019-5--04','人工播种'),(16,'B','B04','阳江市','阳江市B04','根茎类','萝卜','B009','9.12亩','小刘','2019-2-08至2019-4-11','机械播种'),(17,'B','B05','阳江市','阳江市B05','豆类','豌豆','B010','2.56亩','小刘','2019-1-22至2019-5-16','人工播种'),(18,'B','B05','阳江市','阳江市B05','豆类','蚕豆','B011','3.78亩','小刘','2019-2-01至2019-6-13','机械播种'),(19,'C','C01','阳江市','阳江市C01','瓜类','黄瓜','B009','2.89亩','小王','2019-1-14至2019-8-15','人工播种'),(20,'C','C01','潮州市','潮州市C01','瓜类','黄瓜','B009','5.76亩','小王','2019-4-16至2019-12-30','人工播种'),(21,'C','C02','潮州市','潮州市C02','瓜类','黄瓜','B009','5.76亩','小王','2019-4-16至2019-12-30','人工播种'),(22,'C','C03','阳江市','阳江市C03','根茎类','土豆','B006','7.23亩','小王','2019-2-17至2019-6-23','人工播种'),(23,'C','C03','阳江市','阳江市C03','根茎类','萝卜','B005','2.67亩','小王','2019-12至2020-2-10','人工播种'),(24,'C','C03','阳江市','阳江市C03','根茎类','土豆','B009','2.47亩','小王','2019-3-18至2019-8-17','机械播种'),(25,'C','C04','阳江市','阳江市C04','叶菜类','菜心','B002','9.48亩','小王','2019-12-05至2020-2-15','人工播种'),(26,'C','C04','阳江市','阳江市C04','叶菜类','大白菜','B001','8.12亩','小王','2019-5-27至2019-8-19','人工播种'),(27,'C','C05','阳江市','阳江市C05','豆类','蚕豆','B011','5.28亩','小王','2019-8-24至2019-12-27','机械 播种'),(28,'C','C05','阳江市','阳江市C05','豆类','黄豆','B012','1.42亩','小王','2019-1-23至2019-5-16','机械播种'),(29,'C','C05','阳江市','阳江市C05','豆类','豌豆','B010','6.21亩','小王','2019-5-11至2019-8-26','人工播种'),(30,'D','D01','阳江市','阳江市D01','无作物','无','无','无','小徐','2019-3-25至2019-7-12','无'),(31,'D','D02','阳江市','阳江市D02','根茎类','土豆','B006','7.12亩','小徐','2019-6-12至2019-8-05','机械播种'),(32,'D','D03','潮州市','潮州市D03','瓜类','黄瓜','B009','5.76亩','小徐','2019-4-16至2019-12-30','人工播种'),(33,'D','D03','阳江市','阳江市D03','瓜类','黄瓜','B009','1.28亩','小徐','2019-2-02至2019-5-29','机械播种'),(34,'D','D04','阳江市','阳江市D04','葱蒜类','大葱','B013','2.16亩','小徐','2019-8-13至2020-2-02','机械播种'),(35,'D','D04','阳江市','阳江市D04','葱蒜类','蒜苗','B014','6.35亩','小徐','2019-6-27至2020-2-13','机械播种'),(36,'D','D04','阳江市','阳江市D04','葱蒜类','蒜头','B015','1.23亩','小徐','2019-11-23至2020-1-26','机械播种'),(37,'D','D05','阳江市','阳江市D05','叶菜类','菜心','B002','2.47亩','小徐','2019-11-24至2020-2-13','人工播种'),(38,'E','E01','阳江市','阳江市E01','叶菜类','生菜','B003','9.69亩','小杨','2019-10-18至2020-2-16','人工播种'),(39,'E','E02','阳江市','阳江市E02','无作物','无','无','无','小杨','2019-12-12至2020-1-17','无'),(40,'E','E03','潮州市','潮州市E03','瓜类','黄瓜','B009','5.76亩','小杨','2019-4-16至2019-12-30','人工播种'),(41,'E','E04','阳江市','阳江市E04','葱蒜类','大葱','B013','2.18亩','小杨','2019-8-26至2020-1-23','机械播种'),(42,'E','E05','阳江市','阳江市E05','葱蒜类','蒜头','B015','8.73亩','小杨','2019-10-01至2020-2-19','机械播种'),(43,'E','E05','阳江市','阳江市E05','葱蒜类','蒜苗','B014','9.45亩','小杨','2019-5-17至2019-12-24','机械播种'),(44,'A','A01','潮州市','潮州市A01','豆类','蚕豆','B011','11.2亩','小陈','2019-1-22至2019-5-10','机械播种'),(45,'A','A03','潮州市','潮州市A03','瓜类','黄瓜','B009','5.76亩','小陈','2019-4-16至2019-12-30','人工播种'),(46,'A','A02','潮州市','潮州市A02','叶菜类','麦菜','B008','11.2亩','小陈','2019-1-22至2019-5-10','人工播种'),(47,'A','A03','潮州市','潮州市A03','瓜类','黄瓜','B009','5.76亩','小陈','2019-4-16至2019-12-30','人工播种'),(48,'A','A04','潮州市','潮州市A04','瓜类','黄瓜','B009','7.23亩','小陈','2019-1-10至2019-5-12','机械播种'),(49,'A','A05','潮州市','潮州市A05','瓜类','黄瓜','B009','1.03亩','小陈','2020-6-11至2020-1-03','机械播种'),(50,'B','B01','潮州市','潮州市B01','豆类','蚕豆','B011','11.03亩','小李','2019-3-26至2020-1-12','机械播种'),(51,'B','B01','潮州市','潮州市B01','豆类','黄豆','B012','8.43亩','小李','2020-1-10至2020-5-12','机械播种'),(52,'B','B02','潮州市','潮州市B02','无作物','无','无','无','小黄','2019-1-22至2019-5-10','人工播种'),(53,'A','A02','潮州市','潮州市A02','叶菜类','生菜','B003','7.24亩','小陈','2020-1-1至2020-3-05','人工播种'),(54,'A','A01','潮州市','潮州市A01','豆类','豌豆','B010','6.19亩','小陈','2019-9-14至2020-2-18','机械播种'),(55,'B','B03','潮州市','潮州市B03','叶菜类','麦菜','B008','2.26亩','小黄','2019-3-17至2019-7-30','人工播种'),(56,'B','B04','潮州市','潮州市B04','根茎类','土豆','B006','6.62亩','小黄','2019-2-19至2019-12-05','人工播种'),(57,'B','B05','潮州市','潮州市B05','瓜类','黄瓜','B009','5.76亩','小黄','2019-4-16至2019-12-30','人工播种'),(58,'C','C01','潮州市','潮州市C01','豆类','蚕豆','B011','9.35亩','小张','2019-4-13至2019-12-30','机械播种'),(59,'C','C02','潮州市','潮州市C02','豆类','豌豆','B010','2.45亩','小张','2019-5-31至2020-1-20','机械播种'),(60,'C','C03','潮州市','潮州市C03','豆类','黄豆','B012','4.68亩','小张','2019-7-16至2020-3-09','机械播种'),(61,'C','C04','潮州市','潮州市C04','叶菜类','菜心','B002','5.49亩','小张','2019-5-30至2020-1-23','人工播种'),(62,'C','C05','潮州市','潮州市C05','瓜类','黄瓜','B009','8.88亩','小张','2019-7-24至2020-3-04','机械播种'),(63,'A','A01','清远市','清远市A01','无作物','无','无','无','小唐','2019-10-10至2019-12-12','无'),(64,'A','A02','清远市','清远市A02','葱蒜类','大葱','B013','6.93亩','小唐','2019-2-16至2020-2-15','机械播种'),(65,'A','A03','清远市','清远市A03','葱蒜类','大葱','B013','9.14亩','小唐','2019-2-15至2020-3-08','机械播种'),(66,'A','A04','清远市','清远市A04','瓜类','黄瓜','B009','5.76亩','小唐','2019-4-16至2019-12-30','人工播种'),(67,'A','A05','清远市','清远市A05','瓜类','黄瓜','B009','3.29亩','小唐','2019-3-24至2019-7-17','机械播种'),(68,'B','B01','清远市','清远市B01','豆类','黄豆','B012','4.45亩','小张','2019-10-13至2020-3-10','人工播种'),(69,'B','B01','清远市','清远市B01','豆类','黄豆','B012','4.45亩','小张','2019-10-13至2020-3-10','人工播种'),(70,'C','C02','清远市','清远市C02','叶菜类','菜心','B002','9.66亩','小王','2019-12-01至2020-3-10','人工播种'),(71,'C','C02','清远市','清远市C02','叶菜类','菠菜','B004','5.56亩','小杨','2020-3-19','机械播种');

#
# Structure for table "function_management"
#

DROP TABLE IF EXISTS `function_management`;
CREATE TABLE `function_management` (
  `Id` int(11) NOT NULL AUTO_INCREMENT,
  `landmass_id` varchar(255) DEFAULT NULL,
  `landmass_name` varchar(255) DEFAULT NULL,
  `crop_name` varchar(255) DEFAULT NULL,
  `crop_id` varchar(255) DEFAULT '0',
  `farm_operation` varchar(255) DEFAULT NULL,
  `farm_fername` varchar(255) DEFAULT NULL,
  `farm_dosage` varchar(255) DEFAULT NULL,
  `farm_time` varchar(255) DEFAULT NULL,
  `operation_name` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`Id`)
) ENGINE=InnoDB AUTO_INCREMENT=62 DEFAULT CHARSET=utf8;

#
# Data for table "function_management"
#

INSERT INTO `function_management` VALUES (1,'A01','阳江市A01','生菜','B003','农药','杀虫剂','1kg','2020-02-29','张三'),(2,'C03','阳江市C03','土豆','B009','施肥','有机肥','1kg','2020-02-29','李四'),(3,'B05','阳江市B05','豌豆','B010','农药','杀菌剂','2kg','2020-02-29','张三'),(4,'A02','潮州市A02','麦菜','B008','施肥','有机肥','2kg','2020-03-05','王冬'),(5,'A02','潮州市A02','菠菜','B004','施肥','化肥','2kg','2020-03-05','王冬'),(6,'A02','潮州市A02','麦菜','B008','施肥','有机肥','2kg','2020-03-05','王冬'),(7,'A03','潮州市A03','青瓜','B007','施肥','水溶性肥料','2.8kg','2019-08-25','宋楠'),(8,'A04','潮州市A04','黄瓜','B009','施肥','有机肥','3kg','2019-04-16','王冬'),(9,'A04','潮州市A04','黄瓜','B009','施肥','水溶性肥料','1.3kg','2019-12-05','欧婷'),(10,'A05','潮州市A05','青瓜','B007','农药','杀虫剂','4.2kg','2019-04-12','王冬'),(11,'A05','潮州市A05','青瓜','B007','农药','杀虫剂','0.3kg','2020-05-05','王冬'),(12,'A02','潮州市A02','麦菜','B008','施肥','有机肥','2kg','2020-03-05','王冬'),(13,'A02','潮州市A02','麦菜','B008','施肥','有机肥','2kg','2020-03-05','王冬'),(14,'A02','潮州市A02','麦菜','B008','施肥','有机肥','2kg','2020-03-05','王冬'),(15,'A02','潮州市A02','麦菜','B008','施肥','有机肥','2kg','2020-03-05','王冬'),(16,'A02','潮州市A02','麦菜','B008','施肥','有机肥','2kg','2020-03-05','王冬'),(17,'A02','潮州市A02','麦菜','B008','施肥','有机肥','2kg','2020-03-05','王冬'),(18,'A03','潮州市A03','青瓜','B007','采收','瓜类','1kg','2020-03-05','李静'),(19,'B04','阳江市B04','土豆','B006','施肥','化肥','2.1kg','2019-6-14','宋楠'),(20,'B04','阳江市B04','土豆','B006','施肥','化肥','2.1kg','2019-6-14','宋楠'),(21,'B04','阳江市B04','土豆','B006','施肥','化肥','2.1kg','2019-6-14','宋楠'),(22,'B04','阳江市B04','土豆','B006','施肥','化肥','2.1kg','2019-6-14','宋楠'),(23,'B04','阳江市B04','土豆','B006','施肥','化肥','2.1kg','2019-6-14','宋楠'),(24,'B04','阳江市B04','土豆','B006','施肥','化肥','2.1kg','2019-6-14','宋楠'),(25,'B04','阳江市B04','土豆','B006','施肥','化肥','2.1kg','2019-6-14','宋楠'),(26,'B04','阳江市B04','土豆','B006','施肥','化肥','2.1kg','2019-6-14','宋楠'),(27,'A04','阳江市A04','萝卜','B005','施肥','化肥','2.54kg','2020-03-06','晓菲'),(28,'A04','阳江市A04','土豆','B006','施肥','水溶性肥料','1.79kg','2020-03-06','唐静'),(29,'A02','阳江市A02','菜心','B002','农药','杀菌剂','3.21kg','2020-03-06','王冬'),(30,'C03','阳江市C03','土豆','B006','灌溉','浇水','10kg','2020-03-06','丽思'),(31,'D04','阳江市D04','蒜苗','B014','采收','葱蒜类','20kg','2020-03-06','宋楠'),(32,'A01','阳江市A01','菜心','B002','农药','杀虫剂','1kg','2020-03-07','小吴'),(33,'A01','阳江市A01','菜心','B002','农药','杀虫剂','1kg','2020-03-07','小吴'),(34,'A01','阳江市A01','菜心','B002','农药','杀虫剂','1kg','2020-03-07','小吴'),(35,'A01','阳江市A01','大白菜','B001','农药','杀菌剂','3kg','2020-03-07','小吴'),(36,'C02','清远市C02','菜心','B002','施肥','水溶性肥料','3kg','2020-03-09','小吴'),(37,'A03','潮州市A03','青瓜','B007','灌溉','浇水','2kg','2020-03-09','王冬'),(38,'A03','潮州市A03','青瓜','B007','灌溉','浇水','2kg','2020-03-09','王冬'),(39,'A03','潮州市A03','青瓜','B007','灌溉','浇水','2kg','2020-03-09','王冬'),(40,'A03','潮州市A03','青瓜','B007','灌溉','浇水','2kg','2020-03-09','王冬'),(41,'A03','潮州市A03','青瓜','B007','灌溉','浇水','2kg','2020-03-09','王冬'),(42,'A03','潮州市A03','青瓜','B007','灌溉','浇水','2kg','2020-03-09','王冬'),(43,'A02','潮州市A02','菠菜','B004','灌溉','浇水','2.5kg','2020-03-09','宋楠'),(44,'A02','潮州市A02','菠菜','B004','灌溉','浇水','2.5kg','2020-03-09','宋楠'),(45,'A02','潮州市A02','菠菜','B004','灌溉','浇水','2.5kg','2020-03-09','宋楠'),(46,'A02','潮州市A02','菠菜','B004','灌溉','浇水','2.5kg','2020-03-09','宋楠'),(47,'A02','潮州市A02','菠菜','B004','灌溉','浇水','2.5kg','2020-03-09','宋楠'),(48,'A02','潮州市A02','菠菜','B004','灌溉','浇水','2.5kg','2020-03-09','宋楠'),(49,'A02','潮州市A02','菠菜','B004','灌溉','浇水','2.5kg','2020-03-09','宋楠'),(50,'A02','潮州市A02','菠菜','B004','灌溉','浇水','2.5kg','2020-03-09','宋楠'),(51,'A02','潮州市A02','菠菜','B004','灌溉','浇水','2.5kg','2020-03-09','宋楠'),(52,'A02','潮州市A02','菠菜','B004','灌溉','浇水','2.5kg','2020-03-09','宋楠'),(53,'A02','潮州市A02','菠菜','B004','灌溉','浇水','2.5kg','2020-03-09','宋楠'),(54,'A02','潮州市A02','菠菜','B004','采收','叶菜类','6kg','2020-03-09','李沁'),(55,'A01','阳江市A01','大白菜','B001','农药','杀菌剂','1kg','2020-03-18','小吴'),(56,'A01','阳江市A01','大白菜','B001','农药','杀菌剂','1kg','2020-03-18','小吴'),(57,'A01','阳江市A01','大白菜','B001','农药','杀菌剂','1kg','2020-03-18','小吴'),(58,'A01','阳江市A01','大白菜','B001','采收','大白菜','5kg','2020-03-18','小吴'),(59,'D04','阳江市D04','蒜苗','B014','采收','蒜苗','8kg','2020-03-19','小杨'),(60,'C04','潮州市C04','菜心','B002','施肥','有机肥','4kg','2020-03-19','小杨'),(61,'C02','清远市C02','菠菜','B004','采收','叶菜类','6kg','2020-03-19','小杨'),(62,'A01','清远市A01','无','无','施肥','有机肥','2.4kg','2020-03-20','小吴'),(63,'B03','潮州市B03','麦菜','B008','农药','杀虫剂','3kg','2020-03-20','小吴');

#
# Structure for table "landmass_area"
#

DROP TABLE IF EXISTS `landmass_area`;
CREATE TABLE `landmass_area` (
  `Id` int(11) NOT NULL AUTO_INCREMENT,
  `landmass_gps` varchar(255) DEFAULT NULL,
  `landtype` varchar(255) DEFAULT NULL,
  `climate` varchar(255) DEFAULT NULL,
  `plant_area` varchar(255) DEFAULT NULL,
  `sown_area` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`Id`)
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8;

#
# Data for table "landmass_area"
#

INSERT INTO `landmass_area` VALUES (1,'阳江市','台地','终年温暖湿润','265.3亩','1268.7亩次'),(2,'潮州市','平原','四季长青，阳光充足','111亩','123亩次'),(3,'清远市','丘陵','冬季寒冷干燥','136.6亩','242.5亩次');
